# Задача 1. Когда используется критерий Стьюдента, а когда Z –критерий?
# Z критерий используется, если есть генеральная совокупность для нормального распределения.
# Критерий Стьюдента. Все точки данных независимы.
# Размер выборки мал. Для распределения Стьюдента.

# Формулы для нахождния критерий Стьюдента и Z-критерия похожи, но есть различие в значениях сигмы(среднее квадратичное отклонение),
# для Z-критерия дисперсия обычно зарание известна и относится к генеральной совокупности, для критерия Стьюдента ее нужно вычислять отдельно для 
# данной выборки по формуле нахождения несмещенной десперсии.