# Задача 4. Есть ли статистически значимые различия в росте дочерей?
# Рост матерей 172, 177, 158, 170, 178,175, 164, 160, 169, 165
# Рост взрослых дочерей: 173, 175, 162, 174, 175, 168, 155, 170, 160, 163

import numpy as np
from scipy import stats


alpha = 0.05
arr1 = [172, 177, 158, 170, 178,175, 164, 160, 169, 165]
arr2 = [173, 175, 162, 174, 175, 168, 155, 170, 160, 163]
x = np.array(arr1)
y = np.array(arr2)
t_kp = stats.ttest_rel(x,y)
print(t_kp)

# TtestResult(statistic=0.6648478531431979, pvalue=0.5228168632983574, df=9)
# Т.к. pvalue > alpha, то H_0 не отвергается и статистически значимых различий не обнаружено