# Задача 1. Случайная непрерывная величина A имеет равномерное распределение на промежутке (200, 800].
# Найдите ее среднее значение и дисперсию.
a = 200
b = 800
M_x = (a+b)/2 # среднее значение
print(M_x)
D_x = (b-a)**2/12 # дисперсия
print(D_x) 