# Задача 2. О случайной непрерывной равномерно распределенной величине B известно, что ее дисперсия равна 0.2.
# Можно ли найти правую границу величины B и ее среднее значение зная, что левая граница равна 0.5?
# Если да, найдите ее.

import match

b = match.sqrt(24)-0.5
print(f'b = {b}')
M=(0.5+b)/2
